Repository: odicraig/kodi2odi
Catalog: addons/plugin.video.ustvvod/resources/language/*/strings.po
Languages: german

# #30000
source: General
german: Allgemein

# #30001
source: Bitrate Limit (kbps)
german: Bitratenlimit (kbps)

# #30014
source: Enable Subtitles
german: Untertitel aktivieren

# #30015
source: TVDB Lookup
german: TVDB Suche

# #30016
source: On
german: An

# #30017
source: Off
german: Aus

# #30018
source: Quiet
german: Beenden

# #30019
source: Hide Clip-Only Content
german: Einträge nur mit Clips verstecken

# #30020
source: Preferred Stream Type
german: Bevorzugter Streamtyp

# #30021
source: Show Network Names In Favorites
german: Zeige Sendernamen in Favoriten

# #30022
source: Use built-in SSL support
german: Benutze eingebaute SSL Unterstützung

# #30024
source: Yes
german: Ja

# #30025
source: No
german: Nein

# #30033
source: Hide Kodi Favorites
german: Kodi Favoriten verstecken

# #31000
source: Connection
german: Verbindung

# #31001
source: Connection type
german: Verbindungstyp

# #31002
source: Direct
german: Direkt

# #31009
source: User Name
german: Benutzername

# #31010
source: Password
german: Passwort

# #31013
source: Tor Network
german: Tor Netzwerk

# #31014
source: Exit Node
german: Austrittsknoten

# #31015
source: Local Tor Client
german: Lokaler Tor Client

# #31016
source: Running as Service
german: Läuft als Dienst

# #32000
source: Views
german: Ansicht

# #32001
source: Enable Views
german: Ansicht aktivieren

# #32002
source: Thumbnail
german: Fotos

# #32003
source: Poster Wrap
german: Posterumlauf

# #32004
source: List
german: Liste

# #32005
source: Media Info 2
german: Medien Info 2

# #32006
source: Media Info
german: Medien Info

# #32008
source: Big List
german: Große Liste

# #32009
source: Root View
german: Hauptansicht

# #32010
source: Show View
german: Serienansicht

# #32011
source: Category View
german: Kategorieansicht

# #32012
source: Episode View
german: Folgenansicht

# #33000
source: Stations
german: Stationen

# #39000
source: Favorite Shows
german: Favoriten

# #39001
source: Your Favorite Shows On:
german: Deine Favoriten auf:

# #39002
source: All Shows
german: Alle Shows

# #39003
source: All Shows Available On:
german: Alle Shows verfügbar auf:

# #39004
source: Manual Search
german: Manuelle Suche

# #39005
source: Looking up
german: Schaue nach

# #39006
source: USTV VoD - Remove Favorite Mark
german: USTV VoD - Aus Favoriten entfernen

# #39007
source: USTV VoD - Mark as Favorite
german: USTV VoD - Zu Favoriten hinzufügen

# #39008
source: USTV VoD - Refresh TVDB Data
german: USTV VoD - TVDB Daten aktualisieren

# #39009
source: USTV VoD - UnHide Show
german: USTV VoD - Show zeigen

# #39010
source: USTV VoD - Hide Show
german: USTV VoD - Show verstecken

# #39011
source: USTV VoD - Delete Show
german: USTV VoD - Show löschen

# #39012
source: Network:
german: Netzwerk:

# #39014
source: Airs:
german: Sendezeit:

# #39016
source: Caching
german: Zwischenspeichern

# #39017
source: Scanning
german: Scanne

# #39018
source: Grabbing Show list
german: Show Liste einlesen

# #39019
source: Import
german: Importiere

# #39020
source: Select best match:
german: Beste Übereinstimmung wählen:

# #39021
source: USTV VoD - Refresh All TVDB Data
german: USTV VoD - Alle TVDB Daten aktualisieren

# #39022
source: Select Quality
german: Qualität auswählen

# #39023
source: Page Limit
german: Seitenlimit

# #39024
source: Exception
german: Fehler

# #39025
source: Add Episode Identifier
german: Episodennummer hinzufügen

# #39026
source: Loading Subtitles
german: Lade Untertitel

# #39027
source: Downloading
german: Laden

# #39028
source: Enumerating
german: Durchzählen

# #39029
source: Converting
german: Konvertieren

# #39030
source: Error loading subtitles
german: Fehler beim Untertitel laden

# #39031
source: Unlocked Episodes:
german: Nicht gesperrte Episoden:

# #39032
source: Locked Episodes:
german: Gesperrte Episoden:

# #39033
source: %s account required for locked content.
german: %s Konto benötigt für gesperrten Inhalt.

# #39034
source: USTV VoD - Add %s to Library
german: USTV VoD - %s zur Bibliothek hinzufügen

# #39035
source: USTV VoD - Clear Library Directory
german: USTV VoD - Bibliothek Verzeichnis leeren

# #39036
source: USTV VoD Library
german: USTV VoD Bibliothek

# #39037
source: Exported %s
german: Exportiere %s

# #39038
source: Queue
german: Warteschlange

# #39039
source: Show export menu
german: Zeige Exportmenü

# #39040
source: Library Updater Settings
german: Bibliothek Updater Einstellungen

# #39041
source: Library updater script not installed, check repo.
german: Bibliothek Updater Script nicht installiert, Repo prüfen

# #39042
source: Validate sources
german: Quelle bestätigen

# #34000
source: Logins
german: Anmeldedaten

# #34001
source: Use login
german: Benutze Anmeldung

# #35000
source: Export to Library
german: Zur Bibliothek exportieren

# #35001
source: Default Library Folder
german: Standard Bibliothek Ordner

# #35002
source: Custom Library TV Folder
german: Bibliothek TV Ordner anpassen

# #35003
source: Update Library
german: Bibliothek aktualisieren

# #35004
source: Export Episode NFO
german: Serien NFO exportieren

# #35005
source: Export Movie NFO
german: Film NFO exportieren

# #35006
source: Title suffix
german: Titelendung

# #35007
source: Export Show NFO
german: Staffel NFO exportieren

# #35008
source: Clean Library
german: Bibliothek leeren

# #35009
source: Custom Library Movie Folder
german: Bibliothek Film Ordner anpassen
