{"shows": {"/shows/the-doris-day-show/videos": ["THE DORIS DAY SHOW", {"Plot": "The legendary star of radio and movies made her mark on television, too. 'The Doris Day Show' ran for five seasons (1968-1973) and features the dazzling Ms. Day in a role that perfectly captures the sweet, sunny disposition for which she was known.", "TVShowTitle": "THE DORIS DAY SHOW", "Title": "THE DORIS DAY SHOW", "Studio": "MeTV", "MPAA": ""}], "/shows/the-rifleman/videos": ["THE RIFLEMAN", {"Plot": "Dispatching the bad guys with a souped-up, rapid-fire Winchester rifle, Lucas McCain (Chuck Connors) is The Rifleman, a widower, homesteader and peacekeeper in North Fork, New Mexico Territory. A Union veteran of the Civil War, McCain helps maintain order in the rough Old West town while striving to raise his son, Mark (Johnny Crawford), into an honorable and strong man, promoting such values as fair play, neighborliness and the use of violence only as a last resort.", "TVShowTitle": "THE RIFLEMAN", "Title": "THE RIFLEMAN", "Studio": "MeTV", "MPAA": ""}], "/shows/the-abbott-and-costello-show/videos": ["THE ABBOTT AND COSTELLO SHOW", {"Plot": "Bringing their trademark slapstick, puns and gimmicks to the small screen, 'The Abbott and Costello Show' features Bud Abbott and Lou Costello as out-of-work actors and roommates staying at Mr. Field's Hollywood boarding house. Joined by an off-the-wall supporting cast, such as dimwitted policeman Mike Kelly (Gordon Jones) and bratty child Stinky (Joe Besser), Abbott and Costello encapsulate their classic burlesque routines in a loosely plotted television format.", "TVShowTitle": "THE ABBOTT AND COSTELLO SHOW", "Title": "THE ABBOTT AND COSTELLO SHOW", "Studio": "MeTV", "MPAA": ""}], "/shows/invisible-man/videos": ["THE INVISIBLE MAN", {"Plot": "While trying to unlock the secrets to invisibility, British scientist Peter Brady (Tim Turner) suffers a tragic accident that leaves him permanently invisible. With no antidote in sight, Brady becomes an accidental superhero, protecting the British government from spies and saving ordinary citizens from danger. Loosely based on the classic 1897 H.G. Wells novella of the same name, the television series introduces espionage and heroism to Wells' tragic science fiction.", "TVShowTitle": "THE INVISIBLE MAN", "Title": "THE INVISIBLE MAN", "Studio": "MeTV", "MPAA": ""}], "/shows/the_lucy_show/videos": ["THE LUCY SHOW", {"Plot": "In the follow-up to 'I Love Lucy,' Lucille Ball plays widow Lucy Carmichael, a mother of two children who shares a home with divorced friend Vivian Bagley (Vivian Vance of 'I Love Lucy' fame). Carmichael is always scheming—dragging Vivian along with her—and grappling with comic complications related to life on her own and serving as secretary to the grumpy and demanding Mr. Mooney.", "TVShowTitle": "THE LUCY SHOW", "Title": "THE LUCY SHOW", "Studio": "MeTV", "MPAA": ""}], "/shows/the_mothers_in_law/videos": ["THE MOTHERS-IN-LAW", {"Plot": "The story of next-door neighbors turned battling matriarchs, 'The Mothers-in-Law' is a comedic look at how differing values can affect family relations. Eve Hubbard (Eve Arden), Kaye Buell (Kaye Ballard) and their respective families have been next-door neighbors for 15 years, and despite differences in age, temperament and values the women have been best of friends. That is, until the Buell's son, Jerry (Jerry Fogel), and the Hubbards' daughter, Suzie (Deborah Walley), fall in love, marry and set up house in the Hubbards' garage apartment. Because Eve and Kaye have such disparate value sets, trouble arrives in the form of constant meddling in the affairs of their children's new family.", "TVShowTitle": "THE MOTHERS-IN-LAW", "Title": "THE MOTHERS-IN-LAW", "Studio": "MeTV", "MPAA": ""}], "/shows/public-domain-classics/videos": ["PUBLIC DOMAIN CLASSICS", {"Plot": "Here’s where you’ll find an ever-changing assortment of classic public domain programming for your streaming pleasure. We’ve got everything from vintage Westerns and dramas to comedies and more. Come on in and look around—there’s something for everyone in here!", "TVShowTitle": "PUBLIC DOMAIN CLASSICS", "Title": "PUBLIC DOMAIN CLASSICS", "Studio": "MeTV", "MPAA": ""}], "/shows/roller-derby/videos": ["ROLLER DERBY", {"Plot": "The thrills and spills of classic Roller Derby are back! Check out all \r\nthe hard-hitting action on MeTVNetwork.com, where we’ll bring you a new \r\nhigh-flying episode every week. Watch Roller Derby legends jamming their\r\n way past blockers and banked turns, in one of the most breathlessly \r\nexciting TV sports ever—now online for you to watch any time!", "TVShowTitle": "ROLLER DERBY", "Title": "ROLLER DERBY", "Studio": "MeTV", "MPAA": ""}], "/shows/h-r-pufnustuf/videos": ["H.R. PUFNSTUF", {"Plot": "A kids' show unlike any other, 'H.R. Pufnstuf' is set in the far-out fantasy world of Living Island. Wildly imaginative and exploding with color, the series follows young Jimmy and Mayor H.R. Pufnstuf as they struggle to protect Living Island against the far-reaching sorcery of Witchiepoo. This Saturday morning classic was created by legendary producers Sid and Marty Krofft.", "TVShowTitle": "H.R. PUFNSTUF", "Title": "H.R. PUFNSTUF", "Studio": "MeTV", "MPAA": ""}], "/shows/the-donna-reed-show/videos": ["THE DONNA REED SHOW", {"Plot": "Oscar- and Golden Globe-winning actress Donna Reed stars as happy homemaker Donna Stone on this classic feel-good sitcom. 'The Donna Reed Show' portrays a loving family—Donna Stone, husband Alex (Carl Betz) and children Mary and Jeff (Shelly Fabares and Paul Peterson)—that resolves its quarrels with laughter and love. The series includes many cameo appearances by celebrities of the day such as baseball superstars Don Drysdale and Willie May, teen heartthrob James Darren and canine actress Lassie.   ", "TVShowTitle": "THE DONNA REED SHOW", "Title": "THE DONNA REED SHOW", "Studio": "MeTV", "MPAA": ""}], "/shows/public-domain-cartoons/videos": ["CLASSIC CARTOONS", {"Plot": "Here’s where you’ll find an ever-changing assortment of classic public domain cartoons for your streaming pleasure. Check back weekly for animated offerings that will unleash your inner cartoon-hungry child. From classic characters to glorious rarities—relive the early days of animation here!", "TVShowTitle": "CLASSIC CARTOONS", "Title": "CLASSIC CARTOONS", "Studio": "MeTV", "MPAA": ""}], "/shows/land-of-the-lost/videos": ["LAND OF THE LOST", {"Plot": "While rafting on a camping trip, a chance encounter with a 1,000-foot waterfall plunges the Marshall family to an alternate universe. An imaginative Sid and Marty Krofft production, 'Land of the Lost' is a jungle world of no definite place or time, where the Marshalls must deal with dinosaurs and avoid the lizard-like Sleestaks—all while looking for a way home. It's a terrific blend of sic-fi, fantasy and live action adventure that was an essential part of mid-'70s Saturday morning television.", "TVShowTitle": "LAND OF THE LOST", "Title": "LAND OF THE LOST", "Studio": "MeTV", "MPAA": ""}], "/shows/the-saint/videos": ["THE SAINT", {"Plot": "A suave and sophisticated Robin Hood-like adventurer, Simon Templar (Roger Moore) makes his bread and butter stealing from rich criminals, whom he usually manages to get put behind bars in the process. While getting the better of the bad guys, anti-hero Templar must also stay one step ahead of Chief Inspector Claud Eustace Teal (Ivor Dean), who views Templar as a common criminal rather than an advantageous ally.", "TVShowTitle": "THE SAINT", "Title": "THE SAINT", "Studio": "MeTV", "MPAA": ""}], "/shows/peter-gunn/videos": ["PETER GUNN", {"Plot": "A sophisticated hipster and dapper dresser, Peter Gunn (Craig Stevens) is a private eye in the film noir tradition, a cool investigator operating in a nameless waterfront city saturated by a jazz soundtrack that sets the tone for each scene. A frequent patron of Mother's, a wharf-side jazz club at which his nightclub singer girlfriend, Edie (Lola Albright), is employed, Gunn is the epitome of cool, calmly solving cases in style, getting his tips and cautions from coffee-drinking cop pal Lieutenant Jacoby (Herschel Bernardi).", "TVShowTitle": "PETER GUNN", "Title": "PETER GUNN", "Studio": "MeTV", "MPAA": ""}], "/shows/celebrity-bowling/videos": ["CELEBRITY BOWLING", {"Plot": "Just as its name might imply, this fun, friendly show pits pairs of \r\ncelebrities (including a variety of Me-TV regulars) against each other \r\nin 'best ball' bowling matches to earn prizes for audience members. \r\nHosted by Jed Allan, it's a wonderful chance to see the stars out of \r\ncharacter and having a great time with each other.", "TVShowTitle": "CELEBRITY BOWLING", "Title": "CELEBRITY BOWLING", "Studio": "MeTV", "MPAA": ""}], "/shows/the-loretta-young-show/videos": ["THE LORETTA YOUNG SHOW", {"Plot": "<div class=\"fb-like fb_iframe_widget\" data-layout=\"button_count\" data-action=\"like\" data-show-faces=\"false\" data-share=\"false\"><span style=\"vertical-align: bottom; width: 79px; height: 22px;\"></span>", "TVShowTitle": "THE LORETTA YOUNG SHOW", "Title": "THE LORETTA YOUNG SHOW", "Studio": "MeTV", "MPAA": ""}], "/shows/wanted-dead-or-alive/videos": ["WANTED DEAD OR ALIVE", {"Plot": "Steve McQueen stars as bounty hunter with a heart Josh Randall. A Confederate veteran of the Civil War, Randall carries a shortened Winchester Model 1892 carbine, the \"Mare's Leg,\" a gun which he has the ability to draw and fire with lightening speed. Not the typical bounty hunter, Randall often donates his earnings to the needy, and helps his prisoners when he feels they have been wrongly accused.", "TVShowTitle": "WANTED DEAD OR ALIVE", "Title": "WANTED DEAD OR ALIVE", "Studio": "MeTV", "MPAA": ""}], "/shows/jack-lalanne/videos": ["JACK LALANNE", {"Plot": "Stop! Look! Listen! It’s time for the Jack LaLanne Show. Long before \r\nPilates, the Paleo Diet, Jane Fonda, Jamba Juice and all that Jazzercise\r\n became popular, there was Jack LaLanne. The “Godfather of Fitness” \r\nopened America’s first health club in 1936. The Jack LaLanne Physical \r\nCulture Studio — a gym, juice bar, and health food store — kickstarted \r\nthe modern health movement. In 1951, the charismatic Californian brought\r\n his winning regime to the airwaves. Slipping his superhero figure into \r\nhis signature jumpsuit and slippers, LaLanne hosted The Jack LaLanne \r\nShow for 34 years. The knowledge he gleaned from Gray’s Anatomy and his \r\nChiropractic Degree helped him devise exercises for the entire body. His\r\n workouts — what he called “trimnastics” — utilized little more than a \r\nchair and the first rubber exercise stretcher. His dog Happy was there \r\nto help, too. The total-body routines and nutritional advice remain just\r\n as relevant today. Get your heart pumping at home or in the office with\r\n these invigorating videos from the original Jack LaLanne Show. Need \r\nevidence that they work? Jack lived to be 96\r\n                            <br><br>\r\n<h2>Links:</h2>\r\n<a href=\"http://www.jacklalanne.com/\" target=\"_blank\">Jack LaLanne Official Website</a><br>\r\n<a href=\"https://www.facebook.com/officialjacklalanne\" target=\"_blank\">Follow Jack LaLanne on Facebook</a><br>\r\n<a href=\"http://www.jacklalanne.com/blog/\" target=\"_blank\">Jack LaLanne Blog</a><br>\r\n<a href=\"https://instagram.com/officialelainelalanne/\" target=\"_blank\">Follow Jack LaLanne on Instagram</a>", "TVShowTitle": "JACK LALANNE", "Title": "JACK LALANNE", "Studio": "MeTV", "MPAA": ""}], "/shows/mr-lucky/videos": ["MR. LUCKY", {"Plot": "An honest professional gambler with extraordinary luck, Mr. Lucky (John Vivyan) and his good friend, Andamo (Ross Martin), operate a casino aboard the luxury yacht Fortuna. Anchored outside a major American port city, the business never fails to bring the pair trouble in the form of shady criminal elements and individuals on the run.", "TVShowTitle": "MR. LUCKY", "Title": "MR. LUCKY", "Studio": "MeTV", "MPAA": ""}]}}