{"/telenovela/video": ["Telenovela - NBC.com", "Premieres Mon, Jan 4 at 8:30/7:30c. Eva Longoria stars in Telenovela, the comedy about the drama behind the drama. Watch 3 preview episodes now on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/03/NBC-Telenovela-About-1920x1080-UG.jpg"], "/coat-of-many-colors/video": ["Dolly Parton&#039;s Coat of Many Colors", "Watch Thurs, Dec 10 at 9/8c. Alyvia Alyn Lind stars as young Dolly Parton in the inspiring true story based on her life, Coat of Many Colors.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/02/2015-0509-Upfront2015-CoatOfManyColors-KeyArt1920x1080-NS.jpg"], "/the-mysteries-of-laura/video": ["The Mysteries of Laura", "Watch Wednesdays at 8/7c on NBC. Debra Messing stars as an NYPD detective, juggling crime-solving, her ex and devilish twins in The Mysteries of Laura.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/27/2015-0826-MOL-KeyArtImage-1920x1080-KO.jpg"], "/the-player/video": ["The Player", "Watch Thursdays at 10/9c on NBC. Wesley Snipes and Philip Winchester star in this action-packed Vegas thriller about a game with the highest of stakes.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/13/NBC-Player_S1_About_Image_1920x1080_CC.jpg"], "/saturday-night-live/video": ["Saturday Night Live", "Saturdays at 11:30/10:30c on NBC. The Emmy Award-winning comedy show Saturday Night Live is in its 41st season.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/11/25/SNL2014-15_Cast_Photo_1920x1080.jpg"], "/days-of-our-lives/video": ["Days of our Lives | NBC", "Weekdays on NBC, Days of our Lives is all new on NBC. The families of Salem have been entertaining fans for nearly half a century.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/11/07/NBC-Days_AlternateImage_1920x1080_SB2.png"], "/shades-of-blue-en-espanol/video": ["Shades of Blue en Español", "Jueves 10/9c. Jennifer Lopez y Ray Liotta protagnizan Shades of Blue, un drama sobre detectives de la NYPD cuya lealtad se pone a prueba.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/09/2015_ShadesOfBlue_S1_KeyArt_1920x1080_CC.jpg"], "/classic-tv/knight-rider-classic/video": ["Knight Rider Classic", "The classic Knight Rider TV show aired on NBC from 1982 to 1986 and starred David Hasselhoff. Watch full episodes of Season 1 on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Knight-Rider-Original-Keyart.jpg"], "/dateline/video": ["Dateline", "Dateline is NBC’s signature newsmagazine, bringing viewers storytelling at its best. Our stories range from compelling mysteries to powerful documentaries and in-depth investigations. When major news breaks, we go to the scene, putting the pieces together to bring you the full picture.  And in every story we tell, we help the real people who lived the events share their journeys with you. On the air since 1992, Dateline is the longest-running prime-time program on NBC. Our work has been honored time and again with broadcast journalism’s highest awards. Lester Holt is the principal anchor, joined by correspondents Andrea Canning, Hoda Kotb, Josh Mankiewicz, Keith Morrison and Dennis Murphy. ", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/11/05/102314_Dateline_KeyArt_v1.jpg"], "/undateable/video": ["Undateable | NBC", "Live! Fridays at 8/7c on NBC. Undateable chronicles a group of friends&#039; dating trials and triumphs.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/9/17/2015-0916-Undateable-AltAboutImage2-1920x1080-KO_1.jpg"], "/michael-bubles-christmas-special/video": ["Michael Buble&#039;s Christmas in Hollywood | NBC", "Watch the special at NBC.com. Michael Bublé brings the holiday spirit to NBC for the fifth consecutive year with &quot;Michael Bublé&#039;s Christmas in Hollywood.&quot;", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/30/2015-MichaelBubleCH-KeyArt-1920x1080-KO.jpg"], "/classic-tv/lipstick-jungle/video": ["Lipstick Jungle", "NBC&#039;s Lipstick Jungle revolved around the lives of three women and featured Brooke Shields, who starred as Wendy Healy. Watch Season 1 and 2 on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Lipstick-Jungle-Keyart.jpg"], "/chicago-med/video": ["Chicago Med - NBC.com", "Returns all new, Tuesday, January 5 at 9/8c. From Executive Producer Dick Wolf comes the newest drama in the Chicago franchise.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/9/29/2015_ChicagoMed_S1_KeyArt_1920x1080_CC.jpg"], "/classic-tv/do-no-harm/video": ["Do No Harm", "Dr. Jason Cole (Steven Pasquale, &quot;Rescue Me&quot;) is a highly respected neurosurgeon who has it all - a lucrative career, confident charm and the gift of compassion. But he also has a deep, dark secret. One morning, after waking up disoriented in a wrecked hotel room amidst near-naked women he&#039;s never seen before, he knows one thing: it happened again. Every night at the same hour, something inside Jason changes, leaving him almost unrecognizable - seductive, devious, borderline sociopathic. This new man is his dangerous alternate personality, who goes by the name Ian Price. For years Jason has battled Ian, keeping him in check with a powerful experimental sedative. But now his - their - body has developed a resistance to the serum, setting Ian free once again. And to make matters worse, after being suppressed for so long, Ian is hell-bent on taking revenge on his oppressor. With everyone Jason cares about at risk - patients, friends, coworkers and even the woman he loves - he must stop Ian once and for all. Will they find some common ground, or will they bring each other down? Hell hath no fury like an alter ego scorned. &quot;Do No Harm&quot; is produced by Universal Television and Traugott Company. The executive producer/writer is David Schulner (&quot;Desperate Housewives,&quot; &quot;The Event&quot;). Peter Traugott (&quot;Ringer&quot;) and Rachel Kaplan (&quot;Ringer&quot;) are also executive producers. Michael Mayer (NBC&#039;s &quot;Smash&quot;) is the co-executive producer and director.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Do-No-Harm-Keyart.jpg"], "/caught-on-camera-with-nick-cannon/video": ["Caught on Camera", "&quot;Caught on Camera with Nick Cannon&quot; lets viewers in on the hijinks captured by the unblinking eyes of cell phones, dash cams, security cameras, news crews and camcorders around the world.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/12/16/2014_1216_CaughtonCamera_aboutimage_1920x1080_KO.jpg"], "/the-illusionists/video": ["The Illusionists", "One of the hottest shows on Broadway is making its way to TV as &quot;The Illusionists&quot; bring their unique brand of magic. Watch the special online.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/30/2015_1130_Illusionists_AboutImage_1920x1080_AC.jpg"], "/law-and-order-special-victims-unit/video": ["Law &amp; Order: SVU - NBC.com", "Returns all new, Wednesday, January 6 at 9/8c. Watch Law &amp; Order: SVU Wednesdays at 9/8c on NBC. Mariska Hargitay stars in the drama chronicling the investigations of the NYPD&#039;s Special Victims Unit.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/19/2015-0818-NBCUXD-LawOrder_SVU-KeyArtImage-1920x1080-SB.jpg"], "/the-wiz-live/video": ["The Wiz Live!", "From Executive Producers Craig Zadan &amp; Neil Meron with Cirque du Soleil comes a LIVE TV production of the funky Broadway show!", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/10/27/2015-1026-NBCU-The-Wiz-About-Image-1920x1080-UG.jpg"], "/classic-tv/the-event/video": ["The Event", "In the high-octane conspiracy thriller The Event, Sean Walker exposes the biggest cover-up in U.S. history. Watch the full series free on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-The-Event-Keyart.jpg"], "/truth-be-told/video": ["Truth Be Told", "Truth Be Told airs Fridays at 8:30/7:30c on NBC. From the director of How I Met Your Mother comes a bold new comedy about two couples for whom nothing is out of bounds!", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/12/2015_0812_TurthBeTold_AboutImage_1920x1080_AC.jpg"], "/jay-lenos-garage/video": ["Jay Leno’s Garage | NBC", "Explore Jay Leno&#039;s Big Dog Garage, one of the best car collections in the country.", "http://www.nbc.com/sites/nbcunbc/files/files/metaverse_assets/1/0/4/2/1/8/JLG-2012-ShowPrimary-500x281.jpg"], "/classic-tv/charles-in-charge/video": ["Charles in Charge", "When young college student Charles moves in with a busy family, both must rely on each other to take charge of things. Charles faces the challenge of looking after three kids ranging in age from grade school to high school - not to mention keeping an eye on his best friend Buddy, who just wants to hang out and party most of the time, or his Elvis-obsessed mother who tends to drop by unannounced.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Charles-in-Charge-Keyart_0.jpg"], "/the-night-shift/video": ["The Night Shift - NBC", "Watch full episodes on NBC.com. Follow the crazy cases of San Antonio Memorial&#039;s heroic yet fun-loving staff on The Night Shift.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/1/28/NBC-The-Night-Shift-AlternateImage-1920x1080-CH.jpg"], "/heroes-reborn/video": ["Premieres Thurs, Sept 24 at 8/7c on NBC. Hiro and HRG are back with a fresh crop of Heroes in this supernatural drama from creator Tim Kring.", "Thursdays 8/7c on NBC. Hiro and HRG are back with a fresh crop of Heroes in this supernatural drama from creator Tim Kring.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/26/Heroes-Reborn-About-ALT.jpg"], "/classic-tv/quantum-leap/video": ["Quantum Leap", "Time travel with Scott Bakula as Dr. Sam Beckett as he tries to find his final leap home on Quantum Leap. Watch seasons 1 and 2 free on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Quantum-Leap-Keyart.jpg"], "/classic-tv/miami-vice/video": ["Miami Vice", "Starring Don Johnson (&quot;Eastbound and Down,&quot; &quot;From Dusk Till Dawn&quot;) and Philip Michael Thomas (&quot;Nash Bridges,&quot; &quot;Grand Theft Auto: Vice City&quot;), created by Anthony Yerkovich and produced by Michael Mann (&quot;Heat,&quot; &quot;The Insider,&quot; &quot;Collateral,&quot; &quot;The Aviator&quot;), &quot;Miami Vice&quot; focused on the Miami Police Department&#039;s vice squad and its efforts to end drug trafficking and prostitution. Centered on the unlikely partnership of Sonny Crockett and Ricardo Tubbs - who first meet when Tubbs is undercover in a drug cartel - the series ran for five seasons on NBC, from 1984 to 1990. It was both influenced by and a great influence on the popular culture of the time, making use of new wave and other current music as well as introducing the U.S. to the colorful and laid-back styles of Italian men&#039;s fashion. The credits of &quot;Miami Vice&quot; are a who&#039;s-who of guest stars, including Rita Moreno (&quot;West Side Story,&quot; &quot;OZ&quot;), George Takei (&quot;Star Trek&quot;), Terry O&#039;Quinn (&quot;Lost&quot;), Brad Dourif (&quot;Deadwood&quot;), Jimmy Smits (&quot;NYPD Blue,&quot; &quot;The West Wing", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/7/19/NBC-Miami-VIce-Keyart.jpg"], "/the-biggest-loser/video": ["The Biggest Loser | NBC Official Site", "MONDAYS, 9/8c on NBC. Meet the contestants, trainers, find Web exclusives, and more on The Biggest Loser official site at NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/12/01/2015-1125-NBCUXD-The-Biggest-Loser-KeyArt-Image-1920x1080-UG.jpg"], "/amazing-stories/video": ["Amazing Stories", "Created by Steven Spielberg, Amazing Stories is a fantasy, horror, and science fiction television anthology series featuring an all-star roster of guest stars that originally ran on NBC from 1985 to 1987.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/9/23/2015-0917-AmazingStories_1920x1080_LA.jpg"], "/chicago-pd/video": ["Chicago P.D. | NBC", "Watch Wednesdays at 10/9c. From Executive Producer Dick Wolf comes the hard-hitting drama about the men and women of Chicago P.D.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/9/24/NBC-Chicago-PD_S3_AboutImage_1920x1080_CC.jpg"], "/classic-tv/average-joe/video": ["Average Joe", "Comedian, actress and Grammy winner Kathy Griffin (&quot;My Life on the D-List,&quot; &quot;Suddenly Susan&quot;) hosts Season 1 of this unscripted relationship drama with a unique twist. Stunning former beauty queen and NFL cheerleader Melana Scantlin takes up residence in a beautiful Palm Springs mansion, expecting to meet 16 Prince Charmings who will vie to win her heart. What she doesn&#039;t know is that the men she&#039;s about to meet are actually &quot;Average Joes&quot; - nice guys with great hearts, but admittedly average looks - some even describing themselves as nerds and geeks! While Melana must decide how to proceed on a series of group and one-on-one dates, the guys form bonds and rivalries, experiencing a wide range of emotional ups and downs as the series unfolds. &quot;Average Joe&quot; had its series premiere on November 3, 2003 and ran for four seasons on NBC. Season 2, &quot;Average Joe: Hawaii,&quot; premiered on January 5, 2004 and featured former Miss USA contestant and model Larissa Meek, who was swept away to a secluded island paradise for the romantic adventure of a lifetime. The show&#039;s premise flipped for its third season, &quot;Average Joe: Adam Returns,&quot; premiering on March 15, 2004. Nearly 20 million people watched as Adam Mesh had his heart broken in Season 1 - but he came back to call the shots as 19 women tried to win his heart. The fourth and final season, entitled &quot;Average Joe: The Joes Strike Back,&quot; aired in 2005. This time, eliminated Average Joes received a complete makeover and were given a second chance to win Anna Chudoba&#039;s heart. In the end, Anna&#039;s choice surprised America and upset the Joe&#039;s losing streak once and for all.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/7/22/2014_0717_Classics_AverageJoe_Alternate_Image_1920x1080_UG_1.jpg"], "/running-wild-with-bear-grylls/video": ["Running Wild with Bear Grylls", "President Barack Obama joins Bear Grylls for an intimate trek across the Alaskan wilderness in a special edition of &quot;Running Wild with Bear Grylls.&quot;. Bear Grylls takes A-list celebs to remote locations for the adventure of a lifetime on this reality adventure series.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/12/01/2015-1201-RWBGObama-KeyArtImage-1920x1080-KO.jpg"], "/caught-on-camera/video": ["Caught on Camera", "Fridays 8/7c. From the astounding to the absurd, Nick Cannon brings you the best videos caught on cameras from around the world.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/12/16/2014_1216_CaughtonCamera_aboutimage_1920x1080_KO.jpg"], "/the-voice/video": ["The Voice - NBC.com", "Mondays and Tuesdays at 8/7c on NBC. On The Voice, the strongest singers in America compete with help from coaches Adam Levine, Blake Shelton, Gwen Stefani and Pharrell.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/9/02/2015_TheVoice_S9_KeyArtAbout_Image_1920x1080_CC.jpg"], "/telenovela-en-espanol/video": ["Telenovela en Español", "Se estrena el Lunes 4 de Enero a las 8:30/7:30c. Eva Longoria protagoniza Telenovela, una comedia sobre el drama detrás del drama. Ve 3 episodios de pre-estreno ahora en NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/03/NBC-Telenovela-About-1920x1080-UG.jpg"], "/the-carmichael-show/video": ["The Carmichael Show", "Watch Wednesdays 9:30/8:30c on NBC. Jerrod Carmichael stars in the NBC comedy inspired by his outspoken family and therapist-in-training girlfriend.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/17/NBCUXD_TheCarmichaelShow_Logo_Full_1920x1080_LA.png"], "/chicago-fire/video": ["Chicago Fire - NBC.com", "Watch Tuesdays at 10/9c on NBC. From Executive Producer Dick Wolf comes the high-octane drama about the heroes of Chicago Firehouse 51.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/11/2015_ChicagoFire_S4_AboutImage_1920x1080_CC.jpg"], "/classic-tv/outsourced/video": ["Outsourced", "&quot;Outsourced&quot; was a workplace comedy series centered around a catalog-based company, Mid America Novelties, that sells American novelty goods including whoopee cushions, foam fingers and wallets made of bacon, and whose call center has suddenly been outsourced to India. After recently completing Mid America Novelties&#039; manager training program, Todd Dempsy (Ben Rappaport, off-Broadway&#039;s &quot;The Gingerbread House&quot;) learns that the call center is being outsourced to India, and he is asked to move there to be the manager. Having never ventured out of the country, he is unprepared for the culture shock. Overwhelmed, Todd discovers that his new staff needs a crash course in all things American if they are to understand the U.S. product line and ramp up sales from halfway around the world. The sales team Todd inherits includes Gupta (Parvesh Cheena, &quot;Help Me Help You&quot;), a socially awkward employee; Manmeet (Sacha Dhawan, BBC&#039;s &quot;Five Days II&quot;), a young romantic who is enamored with America; Asha (Rebecca Hazlewood, BBC&#039;s &quot;Doctors&quot;), a smart, striking woman who finds herself intrigued by Todd; Rajiv (Rizwan Manji, &quot;Privileged&quot;) the assistant manager who wants Todd&#039;s job; and Madhuri (Anisha Nagarajan, Broadway&#039;s &quot;Bombay Dreams&quot;), a wallflower who suffers from extreme shyness. Todd also discovers other transplants working in his office building, including an American expatriate, Charlie Davies (Diedrich Bader, &quot;The Drew Carey Show&quot;), who runs the All-American Hunter call center, and Tonya (Pippa Black, &quot;Neighbours&quot;), a beautiful Australian who runs the call center for Koala Air. From Universal Media Studios, &quot;Outsourced&quot; is executive produced by showrunner Robert Borden (&quot;The Drew Carey Show,&quot; &quot;George Lopez&quot;) and director Ken Kwapis (&quot;He&#039;s Just Not That Into You,&quot; &quot;The Office&quot;), who developed the project through his company, In Cahoots. Victor Nelli, Jr. (&quot;Ugly Betty&quot;), Tom Gorai (&quot;Outsourced&quot; theatrical release) and David Skinner (&quot;Outsourced&quot; theatrical release) also serve as executive producers, and Alex Beattie serves as co-executive producer.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Outsourced-Keyart_0.jpg"], "/blindspot/video": ["Blindspot - NBC.com", "Premieres Mon, Sept 21 at 10/9c. Amnesiac Jane Doe is covered in new tattoos - the only path to her identity - in the new action thriller Blindspot.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/18/2015-0817-Blindspot-AboutImage-1920x1080-KO.jpg"], "/the-tonight-show/video": ["The Tonight Show Starring Jimmy Fallon - NBC.com", "Visit the official website for The Tonight Show Starring Jimmy Fallon, broadcast live from Rockefeller Center in New York. Weeknights 11:35/10:35c on NBC.", "http://www.nbc.com/the-tonight-show/7157024a/images/hero-late-night-show.png"], "/superstore/video": ["Superstore", "PREMIERES JANUARY 4, MONDAYS 8/7. America Ferrera and Ben Feldman star in Superstore, the comedy about a unique family of employees.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/11/16/Superstore_1920x1080-2.jpg"], "/classic-tv/knight-rider/video": ["Knight Rider", "Knight Rider (2008) starred Justin Bruening as Michael Knight and Val Kilmer as the new KITT. Watch full episodes of Season 1 on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Knight-Rider-Keyart.jpg"], "/classic-tv/deception/video": ["Deception", "Meagan Good, Victor Garber and Tate Donavan star in this primetime soap about the murder of a New York socialite. Watch the full series free on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Deception-Keyart.jpg"], "/elf-buddys-musical-christmas/video": ["Elf: Buddy&#039;s Magic Christmas", "Watch the special at NBC.com. Based on the popular film &quot;Elf&quot; and the hit Broadway show &quot;Elf: The Musical,&quot; the special stars four-time Emmy Award winner Jim Parsons (&quot;The Big Bang Theory&quot;) as Buddy.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/12/01/2014_1103_BuddyTheElf_AboutImage_1920x1080_KO.jpg"], "/classic-tv/life/video": ["Life", "Originally on NBC, Life TV show starred Damian Lewis as detective Charlie Crews. Watch full episodes of Season 1 and 2 on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Life-Keyart.jpg"], "/the-blacklist/video": ["The Blacklist - NBC", "Returns all new, Thursday, January 7 at 9/8c. Thursdays at 9/8c. Watch full episodes of The Blacklist, starring James Spader and Megan Boone, for free, exclusively on the NBC app, Roku or NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/26/NBC-Blacklist_S3_About_Image_1920x1080_CC.jpg"], "/late-night-with-seth-meyers/video": ["Late Night with Seth Meyers | WEEKNIGHTS 12:35/11:35c | NBC", "Weeknights 12:35/11:35c on NBC. Seth Meyers, former SNL &quot;Weekend Update&quot; anchor, is the new host of Late Night.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/9/23/2015_0908_LNSM-About-1920x1080_NW.jpg"], "/meet-the-press/video": ["Meet the Press", "NBC’s Meet the Press is the longest running show on television, providing insights and analysis into all aspects of politics and the nation’s capital. We ask United States and world leaders the tough questions and gather influential voices to critically examine the answers. We delve deep into the polls and tell you how those numbers can affect your life. And we will make you think, because if it’s Sunday, it’s Meet the Press.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2014/11/07/Meet-the-Press-Logo-2014.jpg"], "/aquarius/video": ["Aquarius - NBC.com", "Watch full episodes online. Starring David Duchovny, Aquarius follows LAPD Detective Sam Hodiak as he tracks small-time cult leader Charles Manson.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/3/31/2015-0331-Aquarius-AlternateAboutImage-1920x1080-KO_1.png"], "/classic-tv/battlestar-galactica-classic/video": ["Battlestar Galactica Classic", "Premiere Date September 17, 1978 Starring Richard Hatch as Captain Apollo Lorne Greene as Commander Adama Dirk Benedict as Lieutenant Starbuck Herbert Jefferson Jr. as Lieutenant Boomer John Colicos as Baltar Terry Carter as Colonel Tigh The original series on which the SyFy Channel phenomenon was based, &quot;Battlestar Galactica&quot; ran for a single season on ABC from 1978 to 1979. Created by Glen A. Larson (&quot;Knight Rider,&quot; &quot;Magnum, P.I.&quot;) and starring Richard Hatch (&quot;Dynasty,&quot; &quot;Santa Barbara&quot;) and Lorne Greene (&quot;Bonanza&quot;), &quot;Battlestar Galactica&quot; follows the last surviving warship after a devastating space war. The crew of the Galactica goes in search of the legendary &quot;thirteenth tribe of humanity&quot; and its settlement, &quot;Earth,&quot; while being pursued by warrior robots called Cylons. In its 24-episode run, &quot;Battlestar Galactica&quot; featured guest stars Ed Begley Jr. (&quot;St. Elsewhere,&quot; &quot;Arrested Development&quot;), Jane Seymour (&quot;Dr. Quinn, Medicine Woman&quot;), Lloyd Bridges (&quot;Roots,&quot; &quot;North and South, Book II&quot;), Lew Ayres (&quot;State Fair,&quot; the &quot;Dr. Kildare&quot; film series), John de Lancie (&quot;Star Trek: The Next Generation,&quot; &quot;Torchwood&quot;), Rick Springfield (&quot;General Hospital&quot;), Ray Milland (&quot;Dial M for Murder,&quot; &quot;Love Story&quot;) and Ian Abercrombie (&quot;Twin Peaks,&quot; &quot;Seinfeld,&quot; &quot;Star Wars: The Clone Wars&quot;). Behind-the-camera talents included writer Donald P. Bellisario (&quot;Quantum Leap,&quot; &quot;JAG&quot;), director Winrich Kolbe (&quot;Star Trek: The Next Generation,&quot; &quot;Star Trek: Deep Space Nine,&quot; &quot;Millennium&quot;) and special effects wizard John Dykstra (&quot;Star Wars,&quot; &quot;Star Trek: The Motion Picture,&quot; &quot;Spider-Man,&quot; &quot;X-Men: First Class&quot;). Despite airing for only a single season, &quot;Battlestar Galactica&quot; won a People&#039;s Choice Award for Favorite New TV Drama and Emmys for Outstanding Costume Design and Creative Technical Crafts. It was also nominated for a Golden Globe for Best Drama Series and a Grammy for Best Original Score. In addition, Richard Hatch was nominated for a Golden Globe for Best TV Actor - Drama.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Battlestar-Galactica-Keyart.jpg"], "/classic-tv/kings/video": ["Kings", "Airing on NBC in 2009, the Kings TV show was a drama about current day monarchs of fictional Gilboa. Watch full episodes of Season 1 on NBC.com.", "http://www.nbc.com/sites/nbcunbc/files/files/NBC-Kings-Keyart.jpg"], "/grimm/video": ["Grimm - NBC.com", "Returns Oct. 30 Fridays 9/8c to NBC. A modern twist on the Grimm Brothers&#039; tales, Detective Nick Burkhardt takes on increasing responsibilities fighting crime as a Grimm.", "http://www.nbc.com/sites/nbcunbc/files/files/images/2015/8/21/2105_0729_Grimm_S5_KeyArt_1920x1080_AC.jpg"]}